app/Controllers/Carrito.php

SELECT `id`, `nombre`, `precio`, `descuento`, 5 AS `cantidad`
FROM `productos`
WHERE `id` = 2
AND `activo` = 1
---
    public function mostrar_carrito()
    {
        $session = session();
        $response = [];
        $productos = $session->get('carrito.productos');
        $lista_carrito = [];

        if (!empty($productos)) {
            $db = \Config\Database::connect();

            foreach ($productos as $clave => $cantidad) {
                $query = $db
                    ->table('productos')
                    ->select('id, nombre, precio, descuento, ' . $cantidad . ' AS cantidad')
                    ->where('id', $clave)
                    ->where('activo', 1)
                    ->get();

SELECT `precio`, `descuento`
FROM `productos`
WHERE `id` = '2'
AND `activo` = 1
 LIMIT 1
---
    public function agregar($id, $cantidad)
    {
        $res = 0;
        $carrito = session()->get('carrito');

        if ($id > 0 && $cantidad > 0 && is_numeric($cantidad)) {
            if (isset($carrito['productos'][$id])) {
                $carrito['productos'][$id] = $cantidad;
                $db = \Config\Database::connect();
                $query = $db
                    ->table('productos')
                    ->select('precio, descuento')
                    ->where('id', $id)
                    ->where('activo', 1)
                    ->limit(1)
                    ->get();

UPDATE `productos_carrito` SET `cantidad` = '6'
WHERE `idUser` = '1'
AND `idProducto` = '2'
---
    public function updateSession()
    {
        if ($this->request->isAJAX()) {
            $id = $this->request->getVar('id');
            $cantidad = $this->request->getVar('cantidad');
            $session = session();
            $carrito = $session->get('carrito');

            // Actualiza la cantidad del producto en el carrito
            if (isset($carrito['productos'][$id])) {
                $carrito['productos'][$id] = $cantidad;
                $session->set('carrito', $carrito);
                $datos = [
                    'cantidad' => $cantidad
                ];
                $this->productos_carrito->where('idUser', $session->get('idUser'))->where('idProducto', $id)->set($datos)->update();