app/Controllers/Productos.php

SELECT *
FROM `productos`
---
    public function productos()
    {
        //if ($this->request->isAjax()) {
        $datos['productos'] = $this->productos->findAll();