app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `user` = 'hacel'
 LIMIT 1
UPDATE `usuarios` SET `iniciado` = 1
WHERE `idUser` = '1'
---
    public function valida_inicio()
    {
        $user = $this->request->getVar('user');
        $password = $this->request->getVar('password');

        $datos = $this->usuarios->where('user', $user)->first();
        if ($datos != null && $datos['activo'] == 1) {
            if (password_verify($password, $datos['password'])) {

                $this->usuarios->where('idUser', $datos['idUser'])->set('iniciado', 1)->update();

                $datos = $this->usuarios->where('user', $user)->first();